.data #Τμήμα δήλωσης δεδομένων του προγράμματος
ar: .word 0, 0, 0 
mes1: .asciiz "Onoma: Eleftherios Chondromatidis\n" #αλφαρηθμητικό που ονόμασα mes1
mes2: .asciiz "AM: 02874\n" #αλφαρηθμητικό που ονόμασα mes2
mes3: .asciiz "Eksamhno: 3\n" #αλφαρηθμητικό που ονόμασα mes3
mes4: .asciiz "Grapse 1o arithmo" #αλφαρηθμητικό που ονόμασα mes4
mes5: .asciiz "Grapse 2o arithmo" #αλφαρηθμητικό που ονόμασα mes5
mes6: .asciiz "SUM= " #αλφαρηθμητικό που ονόμασα mes6


.text
.globl main

main:  

li $v0, 4 #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes1 #Φόρτωση διεύθυνσης μνήμης label (mes1) στον καταχωρητή $a0
syscall

li $v0, 4  #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes2 #Φόρτωση διεύθυνσης μνήμης label (mes2) στον καταχωρητή $a0
syscall

li $v0, 4  #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes3 #Φόρτωση διεύθυνσης μνήμης label (mes3) στον καταχωρητή $a0
syscall

la $t0, ar #Φόρτωση διεύθυνσης μνήμης ετικέτας στον καταχωρητή $t0

li $v0, 4  #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes4 #Φόρτωση διεύθυνσης μνήμης label (mes4) στον καταχωρητή $a0
syscall


li $v0, 5 #Κωδικός συστήματος για διάβασμα ακεραίου αριθμού
syscall
sw $v0, 0($t0) #Αποθήκευση περιεχομένου του $v0 στην μηδενική θέση του ar με καταχωρητή βάσης το $t0


li $v0, 4  #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes5 #Φόρτωση διεύθυνσης μνήμης label (mes5) στον καταχωρητή $a0
syscall


li $v0, 5  #Κωδικός συστήματος για διάβασμα ακεραίου αριθμού
syscall
sw $v0, 4($t0) #Αποθήκευση περιεχομένου του $v0 στην ΠΡΩΤΗ θέση του ar με καταχωρητή βάσης το $t0

lw $t1, 0 ($t0) #Φόρτωση περιεχομένου της μηδενικής θέσης του ar και εκχώρηση του σε καταχωρητή $t1
lw $t2, 4 ($t0) #Φόρτωση περιεχομένου της ΠΡΩΤΗΣ θέσης του ar και εκχώρηση του σε καταχωρητή $t2
add $t3, $t2, $t1 #Πρόσθεση των $t2 και $t1 και εκχώρηση του αθροίσματος τους στον καταχωρητή $t3
sw $t3 8($t0) #Αποθήκευση περιεχομένου του $v0 στην ΔΕΥΤΕΡΗ θέση του ar με καταχωρητή βάσης το $t0


li $v0, 4 #Κωδικός συστήματος για εμφάνιση αλφαριθμητικού
la $a0, mes6 #Φόρτωση διεύθυνσης μνήμης label (mes6) στον καταχωρητή $a0
syscall

li $v0,1 #Κωδικός συστήματος για εμφάνιση ακέραιου αριθμού
move $a0, $t3 #Πέρασμα τιμής του $t3 στον καταχωρητή $a0
syscall

li $v0, 10 #Κωδικός συστήματος για έξοδο από το πρόγραμμα 
syscall
